Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_semc.c
/****************************************************************************
 *
 * Copyright 2019 NXP Semiconductors All Rights Reserved.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing,
 * software distributed under the License is distributed on an
 * "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND,
 * either express or implied. See the License for the specific
 * language governing permissions and limitations under the License.
 *
 ****************************************************************************/

/*
 * Copyright 2017-2018 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include <stddef.h>
#include <string.h>
#include "imxrt_clock.h"
#include "imxrt_semc.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Define macros for SEMC driver. */
#define SEMC_IPCOMMANDDATASIZEBYTEMAX (4U)
#define SEMC_IPCOMMANDMAGICKEY (0xA55A)
#define SEMC_IOCR_PINMUXBITWIDTH (0x3U)
#define SEMC_IOCR_NAND_CE (4U)
#define SEMC_IOCR_NOR_CE (5U)
#define SEMC_IOCR_NOR_CE_A8 (2U)
#define SEMC_IOCR_PSRAM_CE (6U)
#define SEMC_IOCR_PSRAM_CE_A8 (3U)
#define SEMC_IOCR_DBI_CSX (7U)
#define SEMC_IOCR_DBI_CSX_A8 (4U)
#define SEMC_NORFLASH_SRAM_ADDR_PORTWIDTHBASE (24U)
#define SEMC_NORFLASH_SRAM_ADDR_PORTWIDTHMAX (28U)
#define SEMC_BMCR0_TYPICAL_WQOS (5U)
#define SEMC_BMCR0_TYPICAL_WAGE (8U)
#define SEMC_BMCR0_TYPICAL_WSH (0x40U)
#define SEMC_BMCR0_TYPICAL_WRWS (0x10U)
#define SEMC_BMCR1_TYPICAL_WQOS (5U)
#define SEMC_BMCR1_TYPICAL_WAGE (8U)
#define SEMC_BMCR1_TYPICAL_WPH (0x60U)
#define SEMC_BMCR1_TYPICAL_WBR (0x40U)
#define SEMC_BMCR1_TYPICAL_WRWS (0x24U)
#define SEMC_STARTADDRESS (0x80000000U)
#define SEMC_ENDADDRESS (0xDFFFFFFFU)
#define SEMC_BR_MEMSIZE_MIN (4)
#define SEMC_BR_MEMSIZE_OFFSET (2)
#define SEMC_BR_MEMSIZE_MAX (4 * 1024 * 1024)
#define SEMC_SDRAM_MODESETCAL_OFFSET (4)
#define SEMC_BR_REG_NUM (9)
#define SEMC_BYTE_NUMBIT (8)
/*******************************************************************************
 * Prototypes
 ******************************************************************************/
/****************************************************************************
 * Function: imxrt_semc_getinstance
 *
 * Description:
 *   brief Get instance number for SEMC module.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *
 * Returned Value:
 *   Returns instance.
 *
 ****************************************************************************/
static uint32_t imxrt_semc_getinstance(SEMC_Type *base);

/****************************************************************************
 * Function: imxrt_semc_convertmemorysize
 *
 * Description:
 *   brief Covert the input memory size to internal register set value.
 *
 * Input Parameters:
 *   base  SEMC peripheral base address.
 *   size_kbytes SEMC memory size in unit of kbytes.
 *   sizeConverted SEMC converted memory size to 0 ~ 0x1F.
 *
 * Returned Value:
 *   Returns Execution status..
 *
 ****************************************************************************/
static status_t imxrt_semc_convertmemorysize(SEMC_Type *base, uint32_t size_kbytes, uint8_t *sizeConverted);

/****************************************************************************
 * Function: imxrt_semc_converttiming
 *
 * Description:
 *   brief Covert the external timing nanosecond to internal clock cycle.
 *
 * Input Parameters:
 *   time_ns   SEMC external time interval in unit of nanosecond.
 *   clkSrc_Hz SEMC clock source frequency.
 *
 * Returned Value:
 *   Returns The changed internal clock cycle.
 *
 ****************************************************************************/
static uint8_t imxrt_semc_converttiming(uint32_t time_ns, uint32_t clkSrc_Hz);

/****************************************************************************
 * Function: imxrt_semc_configureipcommand
 *
 * Description:
 *   brief Configure IP command.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   size_bytes SEMC IP command data size.
 *
 * Returned Value:
 *   Returns Execution status.
 *
 ****************************************************************************/
static status_t imxrt_semc_configureipcommand(SEMC_Type *base, uint8_t size_bytes);

/****************************************************************************
 * Function: imxrt_semc_isipcommanddone
 *
 * Description:
 *   brief Check if the IP command has finished.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *
 * Returned Value:
 *   Returns Execution status.
 *
 ****************************************************************************/
static status_t imxrt_semc_isipcommanddone(SEMC_Type *base);

/*******************************************************************************
 * Variables
 ******************************************************************************/

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
/*! @brief Pointers to SEMC clocks for each instance. */
static const clock_ip_name_t s_semcClock[FSL_FEATURE_SOC_SEMC_COUNT] = SEMC_CLOCKS;
static const clock_ip_name_t s_semcExtClock[FSL_FEATURE_SOC_SEMC_COUNT] = SEMC_EXSC_CLOCKS;
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

/*! @brief Pointers to SEMC bases for each instance. */
static SEMC_Type *const s_semcBases[] = SEMC_BASE_PTRS;
/*******************************************************************************
 * Code
 ******************************************************************************/
static uint32_t imxrt_semc_getinstance(SEMC_Type *base)
{
    uint32_t instance;

    /* Find the instance index from base address mappings. */
    for (instance = 0; instance < ARRAY_SIZE(s_semcBases); instance++)
    {
        if (s_semcBases[instance] == base)
        {
            break;
        }
    }

    assert(instance < ARRAY_SIZE(s_semcBases));

    return instance;
}

static status_t imxrt_semc_convertmemorysize(SEMC_Type *base, uint32_t size_kbytes, uint8_t *sizeConverted)
{
    assert(sizeConverted);
    uint32_t memsize;

