Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_semc.c
    if ((size_kbytes < SEMC_BR_MEMSIZE_MIN) || (size_kbytes > SEMC_BR_MEMSIZE_MAX))
    {
        return kStatus_SEMC_InvalidMemorySize;
    }

    *sizeConverted = 0;
    memsize = size_kbytes / 8;
    while (memsize)
    {
        memsize >>= 1;
        (*sizeConverted)++;
    }
    return kStatus_Success;
}

static uint8_t imxrt_semc_converttiming(uint32_t time_ns, uint32_t clkSrc_Hz)
{
    assert(clkSrc_Hz);

    uint8_t clockCycles = 0;
    uint32_t tClk_us;

    clkSrc_Hz /= 1000000;
    tClk_us = 1000000 / clkSrc_Hz;

    while (tClk_us * clockCycles < (time_ns * 1000))
    {
        clockCycles++;
    }

    return clockCycles;
}

static status_t imxrt_semc_configureipcommand(SEMC_Type *base, uint8_t size_bytes)
{
    if ((size_bytes > SEMC_IPCOMMANDDATASIZEBYTEMAX) || (!size_bytes))
    {
        return kStatus_SEMC_InvalidIpcmdDataSize;
    }

    /* Set data size. */
    /* Note: It is better to set data size as the device data port width when transfering
     *    device command data. but for device memory data transfer, it can be set freely.
     * Note: If the data size is greater than data port width, for example, datsz = 4, data port = 16bit,
     *    then the 4-byte data transfer will be split into two 2-byte transfer, the slave address
     *    will be switched automatically according to connected device type*/
    base->IPCR1 = SEMC_IPCR1_DATSZ(size_bytes);
    /* Clear data size. */
    base->IPCR2 = 0;
    /* Set data size. */
    if (size_bytes < 4)
    {
        base->IPCR2 |= SEMC_IPCR2_BM3_MASK;
    }
    if (size_bytes < 3)
    {
        base->IPCR2 |= SEMC_IPCR2_BM2_MASK;
    }
    if (size_bytes < 2)
    {
        base->IPCR2 |= SEMC_IPCR2_BM1_MASK;
    }
    return kStatus_Success;
}

static status_t imxrt_semc_isipcommanddone(SEMC_Type *base)
{
    /* Poll status bit till command is done*/
    while (!(base->INTR & SEMC_INTR_IPCMDDONE_MASK))
    {
    };

    /* Clear status bit */
    base->INTR |= SEMC_INTR_IPCMDDONE_MASK;

    /* Check error status */
    if (base->INTR & SEMC_INTR_IPCMDERR_MASK)
    {
        base->INTR |= SEMC_INTR_IPCMDERR_MASK;
        return kStatus_SEMC_IpCommandExecutionError;
    }

    return kStatus_Success;
}

/****************************************************************************
 * Function: imxrt_semc_getdefaultconfig
 *
 * Description:
 *   brief Gets the SEMC default basic configuration structure.
 *   
 *   The purpose of this API is to get the default SEMC
 *   configure structure for SEMC_Init(). User may use the initialized
 *   structure unchanged in SEMC_Init(), or modify some fields of the
 *   structure before calling SEMC_Init().
 *   Example:
     code
     semc_config_t config;
     imxrt_semc_getdefaultconfig(&config);
     endcode
 *
 * Input Parameters:
 *   config The SEMC configuration structure pointer.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/
void imxrt_semc_getdefaultconfig(semc_config_t *config)
{
    assert(config);

    /* Initializes the configure structure to zero. */
    memset(config, 0, sizeof(*config));

    semc_queuea_weight_struct_t *queueaWeight = &(config->queueWeight.queueaWeight.queueaConfig);
    semc_queueb_weight_struct_t *queuebWeight = &(config->queueWeight.queuebWeight.queuebConfig);

    /* Get default settings. */
    config->dqsMode = kSEMC_Loopbackinternal;
    config->cmdTimeoutCycles = 0;
    config->busTimeoutCycles = 0x1F;

    queueaWeight->qos = SEMC_BMCR0_TYPICAL_WQOS;
    queueaWeight->aging = SEMC_BMCR0_TYPICAL_WAGE;
    queueaWeight->slaveHitSwith = SEMC_BMCR0_TYPICAL_WSH;
    queueaWeight->slaveHitNoswitch = SEMC_BMCR0_TYPICAL_WRWS;
    queuebWeight->qos = SEMC_BMCR1_TYPICAL_WQOS;
    queuebWeight->aging = SEMC_BMCR1_TYPICAL_WAGE;
    queuebWeight->slaveHitSwith = SEMC_BMCR1_TYPICAL_WRWS;
    queuebWeight->weightPagehit = SEMC_BMCR1_TYPICAL_WPH;
    queuebWeight->bankRotation = SEMC_BMCR1_TYPICAL_WBR;
}

/****************************************************************************
 * Function: imxrt_semc_init
 *
 * Description:
 *   brief Initializes SEMC.
 *   This function ungates the SEMC clock and initializes SEMC.
 *   This function must be called before calling any other SEMC driver functions.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   configure The SEMC configuration structure pointer.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/
void imxrt_semc_init(SEMC_Type *base, semc_config_t *configure)
{
    assert(configure);

    uint8_t index = 0;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Un-gate sdram controller clock. */
    imxrt_clock_enableclock(s_semcClock[imxrt_semc_getinstance(base)]);
    imxrt_clock_enableclock(s_semcExtClock[imxrt_semc_getinstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */

    /* Initialize all BR to zero due to the default base address set. */
    for (index = 0; index < SEMC_BR_REG_NUM; index++)
    {
        base->BR[index] = 0;
    }

    /* Software reset for SEMC internal logical . */
    base->MCR = SEMC_MCR_SWRST_MASK;
    while (base->MCR & SEMC_MCR_SWRST_MASK)
    {
    }

    /* Configure, disable module first. */
    base->MCR |= SEMC_MCR_MDIS_MASK | SEMC_MCR_BTO(configure->busTimeoutCycles) |
                 SEMC_MCR_CTO(configure->cmdTimeoutCycles) | SEMC_MCR_DQSMD(configure->dqsMode);

    /* Configure Queue 0/1 for AXI bus. */
    base->BMCR0 = (uint32_t)(configure->queueWeight.queueaWeight.queueaValue);
    base->BMCR1 = (uint32_t)(configure->queueWeight.queuebWeight.queuebValue);

    /* Enable SEMC. */
    base->MCR &= ~SEMC_MCR_MDIS_MASK;
}

/****************************************************************************
 * Function: imxrt_semc_deinit
 *
 * Description:
 *   brief Deinitializes the SEMC module and gates the clock.
 *   This function gates the SEMC clock. As a result, the SEMC
 *   module doesn't work after calling this function.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/
void imxrt_semc_deinit(SEMC_Type *base)
{
    /* Disable module.  Check there is no pending command before disable module.  */
    while (!(base->STS0 & SEMC_STS0_IDLE_MASK))
    {
        ;
    }

    base->MCR |= SEMC_MCR_MDIS_MASK | SEMC_MCR_SWRST_MASK;

#if !(defined(FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL) && FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL)
    /* Disable SDRAM clock. */
    imxrt_clock_disableclock(s_semcClock[imxrt_semc_getinstance(base)]);
    imxrt_clock_disableclock(s_semcExtClock[imxrt_semc_getinstance(base)]);
#endif /* FSL_SDK_DISABLE_DRIVER_CLOCK_CONTROL */
}

/****************************************************************************
 * Function: imxrt_semc_configuresdram
 *
 * Description:
 *   brief Configures SDRAM controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   cs The chip selection.
 *   config The sdram configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_configuresdram(SEMC_Type *base, semc_sdram_cs_t cs, semc_sdram_config_t *config, uint32_t clkSrc_Hz)
{
    assert(config);
    assert(clkSrc_Hz);
    assert(config->refreshBurstLen);

    uint8_t memsize;
    status_t result = kStatus_Success;
    uint16_t prescale = config->tPrescalePeriod_Ns / 16 / (1000000000 / clkSrc_Hz);
    uint16_t refresh;
    uint16_t urgentRef;
    uint16_t idle;
    uint16_t mode;

    if ((config->address < SEMC_STARTADDRESS) || (config->address > SEMC_ENDADDRESS))
    {
        return kStatus_SEMC_InvalidBaseAddress;
    }

    if (config->csxPinMux == kSEMC_MUXA8)
    {
        return kStatus_SEMC_InvalidSwPinmuxSelection;
    }

    if (prescale > 256)
    {
        return kStatus_SEMC_InvalidTimerSetting;
    }

    refresh = config->refreshPeriod_nsPerRow / config->tPrescalePeriod_Ns;
    urgentRef = config->refreshUrgThreshold / config->tPrescalePeriod_Ns;
    idle = config->tIdleTimeout_Ns / config->tPrescalePeriod_Ns;

    uint32_t iocReg = base->IOCR & ~(SEMC_IOCR_PINMUXBITWIDTH << config->csxPinMux);

