Samsung/TizenRT/os/arch/arm/src/imxrt/imxrt_semc.c
    /* Timing setting. */
    base->SRAMCR1 = SEMC_SRAMCR1_CES(imxrt_semc_converttiming(config->tCeSetup_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_CEH(imxrt_semc_converttiming(config->tCeHold_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_AS(imxrt_semc_converttiming(config->tAddrSetup_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_AH(imxrt_semc_converttiming(config->tAddrHold_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_WEL(imxrt_semc_converttiming(config->tWeLow_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_WEH(imxrt_semc_converttiming(config->tWeHigh_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_REL(imxrt_semc_converttiming(config->tReLow_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR1_REH(imxrt_semc_converttiming(config->tReHigh_Ns, clkSrc_Hz));

    base->SRAMCR2 = SEMC_SRAMCR2_WDS(imxrt_semc_converttiming(config->tWriteSetup_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR2_WDH(imxrt_semc_converttiming(config->tWriteHold_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR2_TA(imxrt_semc_converttiming(config->tTurnAround_Ns, clkSrc_Hz)) |
                    SEMC_SRAMCR2_AWDH(imxrt_semc_converttiming(config->tAddr2WriteHold_Ns, clkSrc_Hz) + 1) |
                    SEMC_SRAMCR2_LC(config->latencyCount) | SEMC_SRAMCR2_RD(config->readCycle) |
                    SEMC_SRAMCR2_CEITV(imxrt_semc_converttiming(config->tCeInterval_Ns, clkSrc_Hz));

    return result;
}

/****************************************************************************
 * Function: imxrt_semc_configuredbi
 *
 * Description:
 *   brief Configures DBI controller in SEMC.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   config The dbi configuration.
 *   clkSrc_Hz The SEMC clock frequency.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_configuredbi(SEMC_Type *base, semc_dbi_config_t *config, uint32_t clkSrc_Hz)
{
    assert(config);

    uint8_t memsize;
    status_t result;

    if ((config->address < SEMC_STARTADDRESS) || (config->address > SEMC_ENDADDRESS))
    {
        return kStatus_SEMC_InvalidBaseAddress;
    }

    uint32_t iocReg = base->IOCR & ~(SEMC_IOCR_PINMUXBITWIDTH << config->csxPinMux);
    uint32_t muxCsx = (config->csxPinMux == kSEMC_MUXRDY) ?
                          SEMC_IOCR_DBI_CSX - 1 :
                          ((config->csxPinMux == kSEMC_MUXA8) ? SEMC_IOCR_DBI_CSX_A8 : SEMC_IOCR_DBI_CSX);

    /* IOMUX setting. */
    base->IOCR = iocReg | (muxCsx << config->csxPinMux);
    /* Base control. */
    result = imxrt_semc_convertmemorysize(base, config->memsize_kbytes, &memsize);
    if (result != kStatus_Success)
    {
        return result;
    }
    base->BR[7] = (config->address & SEMC_BR_BA_MASK) | SEMC_BR_MS(memsize) | SEMC_BR_VLD_MASK;
    base->DBICR0 =
        SEMC_DBICR0_PS(config->portSize) | SEMC_DBICR0_BL(config->burstLen) | SEMC_DBICR0_COL(config->columnAddrBitNum);

    /* Timing setting. */
    base->DBICR1 = SEMC_DBICR1_CES(imxrt_semc_converttiming(config->tCsxSetup_Ns, clkSrc_Hz) - 1) |
                   SEMC_DBICR1_CEH(imxrt_semc_converttiming(config->tCsxHold_Ns, clkSrc_Hz) - 1) |
                   SEMC_DBICR1_WEL(imxrt_semc_converttiming(config->tWexLow_Ns, clkSrc_Hz) - 1) |
                   SEMC_DBICR1_WEH(imxrt_semc_converttiming(config->tWexHigh_Ns, clkSrc_Hz) - 1) |
                   SEMC_DBICR1_REL(imxrt_semc_converttiming(config->tRdxLow_Ns, clkSrc_Hz) - 1) |
                   SEMC_DBICR1_REH(imxrt_semc_converttiming(config->tRdxHigh_Ns, clkSrc_Hz) - 1) |
                   SEMC_DBICR1_CEITV(imxrt_semc_converttiming(config->tCsxInterval_Ns, clkSrc_Hz) - 1);
    return imxrt_semc_configureipcommand(base, (config->portSize + 1));
}

/****************************************************************************
 * Function: imxrt_semc_sendipcommand
 *
 * Description:
 *   brief SEMC IP command access.
 *
 * Input Parameters:
 *   base SEMC peripheral base address.
 *   type  SEMC memory type. refer to "semc_mem_type_t"
 *   address  SEMC device address.
 *   command  SEMC IP command.
 *     For NAND device, we should use the SEMC_BuildNandIPCommand to get the right nand command.
 *     For NOR/DBI device, take refer to "semc_ipcmd_nor_dbi_t".
 *     For SRAM device, take refer to "semc_ipcmd_sram_t".
 *     For SDRAM device, take refer to "semc_ipcmd_sdram_t".
 *   write  Data for write access.
 *   read   Data pointer for read data out.
 *
 * Returned Value:
 *   Returns status.
 *
 ****************************************************************************/
status_t imxrt_semc_sendipcommand(
    SEMC_Type *base, semc_mem_type_t type, uint32_t address, uint16_t command, uint32_t write, uint32_t *read)
{
    uint32_t cmdMode;
    bool readCmd = 0;
    bool writeCmd = 0;
    status_t result;

    /* Clear status bit */
    base->INTR |= SEMC_INTR_IPCMDDONE_MASK;
    /* Set address. */
    base->IPCR0 = address;

    /* Check command mode. */
    cmdMode = command & 0xFU;
    switch (type)
    {
        case kSEMC_MemType_NAND:
            readCmd = (cmdMode == kSEMC_NANDCM_CommandAddressRead) || (cmdMode == kSEMC_NANDCM_CommandRead) ||
                      (cmdMode == kSEMC_NANDCM_Read);
            writeCmd = (cmdMode == kSEMC_NANDCM_CommandAddressWrite) || (cmdMode == kSEMC_NANDCM_CommandWrite) ||
                       (cmdMode == kSEMC_NANDCM_Write);
            break;
        case kSEMC_MemType_NOR:
        case kSEMC_MemType_8080:
            readCmd = (cmdMode == kSEMC_NORDBICM_Read);
            writeCmd = (cmdMode == kSEMC_NORDBICM_Write);
            break;
        case kSEMC_MemType_SRAM:
            readCmd = (cmdMode == kSEMC_SRAMCM_ArrayRead) || (cmdMode == kSEMC_SRAMCM_RegRead);
            writeCmd = (cmdMode == kSEMC_SRAMCM_ArrayWrite) || (cmdMode == kSEMC_SRAMCM_RegWrite);
            break;
        case kSEMC_MemType_SDRAM:
            readCmd = (cmdMode == kSEMC_SDRAMCM_Read);
            writeCmd = (cmdMode == kSEMC_SDRAMCM_Write) || (cmdMode == kSEMC_SDRAMCM_Modeset);
            break;
        default:
            break;
    }

    if (writeCmd)
    {
        /* Set data. */
        base->IPTXDAT = write;
    }

